issue-tracking/app/controllers/comments_controller.rb

   def create
    @comment = Comment.new(
      comment: params[:comment][:comment],
      ticket_id: params[:id],
      user_id: current_user.id
      )
    @comment.save
---
INSERT INTO "comments" ("comment", "ticket_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "alkndasldknasdlansd"], ["ticket_id", 1], ["user_id", 2], ["created_at", "2016-12-02 17:28:14.181441"], ["updated_at", "2016-12-02 17:28:14.181441"]]