issue-tracking/app/controllers/tickets_controller.rb

  def show
    @comments = Comment.where(ticket_id: @ticket).order("created_at DESC")
---
SELECT "comments".* FROM "comments" WHERE "comments"."ticket_id" = 1  ORDER BY DESC :created_at

  def create
    @ticket = Ticket.new(ticket_params)
    @ticket.user = current_user
    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "alsdn"], ["description", "ladsknalsdkn"], ["user_id", 1], ["created_at", "2016-12-02 16:25:40.580115"], ["updated_at", "2016-12-02 16:25:40.580115"]]