issue-tracking/app/controllers/users_controller.rb

SELECT "roles".* FROM "roles"
---
  def edit_user
    @roles = Role.all

SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT "roles".* FROM "roles" INNER JOIN "role_users" ON "roles"."id" = "role_users"."role_id" WHERE "role_users"."user_id" = $1  [["user_id", 3]]
INSERT INTO "role_users" ("user_id", "role_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["role_id", 1], ["created_at", "2016-12-02 13:58:32.610512"], ["updated_at", "2016-12-02 13:58:32.610512"]]
UPDATE "users" SET "status" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["status", "t"], ["updated_at", "2016-12-02 19:29:30.932295"], ["id", 1]]
---
  def update
     @user.role_users.map{|x| x.destroy}
    params[:roles].each do |role|
      RoleUser.create(user_id: @user.id, role_id: role)
    end
    @user.status = params[:status]
    @user.save